OpenNuvoton/NUC970_U-Boot_v2016.11/include/nuc970_crypto.h
/*************************************************************************
 * Nuvoton Electronics Corporation confidential
 *
 * Copyright (c) 2013 by Nuvoton Electronics Corporation
 * All rights reserved
 *
 * FILENAME
 *     crypto.h
 *
 * REMARK
 *     None
 **************************************************************************/

#ifndef _CRYPTO_H_
#define _CRYPTO_H_

#include "nuc970_register.h"

typedef volatile unsigned int UINT32;

typedef struct
{
	UINT32 IPSEC_INT_EN;				/*!< Offset: 0x0000   IPsec interrupt enable                             */
	UINT32 IPSEC_INT_FLAG;				/*!< Offset: 0x0004   IPsec interrupt flag                               */
	UINT32 PRNG_CTL;				/*!< Offset: 0x0008   PRNG  control register                             */
	UINT32 PRNG_SEED;				/*!< Offset: 0x000C   Store  random seed                                 */
	UINT32 PRNG_key0;				/*!< Offset: 0x0010   PRNG  generated  Key0                              */
	UINT32 PRNG_key1;				/*!< Offset: 0x0014   PRNG  generated  Key1                              */
	UINT32 PRNG_key2;				/*!< Offset: 0x0018   PRNG  generated  Key2                              */
	UINT32 PRNG_key3;				/*!< Offset: 0x001C   PRNG  generated  Key3                              */
	UINT32 PRNG_key4;				/*!< Offset: 0x0020   PRNG  generated  Key4                              */
	UINT32 PRNG_key5;				/*!< Offset: 0x0024   PRNG  generated  Key5                              */
	UINT32 PRNG_key6;				/*!< Offset: 0x0028   PRNG  generated  Key6                              */
	UINT32 PRNG_key7;				/*!< Offset: 0x002C   PRNG  generated  Key7                              */
	UINT32 RESERVED1[8];				/*!< Offset: 0x0030 ~ 0x004C   Reserved                                  */
	UINT32 AES_FEEDBACK_0;				/*!< Offset: 0x0050   AES engine 0 Output feedback data after cryptographic operation */
	UINT32 AES_FEEDBACK_1;				/*!< Offset: 0x0054   AES engine 1 Output feedback data after cryptographic operation */
	UINT32 AES_FEEDBACK_2;				/*!< Offset: 0x0058   AES engine 2 Output feedback data after cryptographic operation */
	UINT32 AES_FEEDBACK_3;				/*!< Offset: 0x005C   AES engine 3 Output feedback data after cryptographic operation */
	UINT32 TDES_FEEDBACK_H;				/*!< Offset: 0x0060   Triple DES engine Output higher feedback data after cryptographic operation */
	UINT32 TDES_FEEDBACK_L;				/*!< Offset: 0x0064   Triple DES engine Output lower feedback data after cryptographic operation */
	UINT32 RESERVED2[38];				/*!< Offset: 0x0068 ~ 0x00FC   Reserved                                  */
	UINT32 AES_CTL;					/*!< Offset: 0x0100   AES engine setting                                 */
	UINT32 AES_FLAG;				/*!< Offset: 0x0104   AES engine flag                                    */
	UINT32 AES_DATAIN;				/*!< Offset: 0x0108   AES engine data input port                         */
	UINT32 AES_DATAOUT;				/*!< Offset: 0x010C   AES engine data output port                        */
	UINT32 AES_KEY_0;				/*!< Offset: 0x0110   AES Key Word 0 Register                            */
	UINT32 AES_KEY_1;				/*!< Offset: 0x0114   AES Key Word 1 Register                            */
	UINT32 AES_KEY_2;				/*!< Offset: 0x0118   AES Key Word 2 Register                            */
	UINT32 AES_KEY_3;				/*!< Offset: 0x011C   AES Key Word 3 Register                            */
	UINT32 AES_KEY_4;				/*!< Offset: 0x0120   AES Key Word 4 Register                            */
	UINT32 AES_KEY_5;				/*!< Offset: 0x0124   AES Key Word 5 Register                            */
	UINT32 AES_KEY_6;				/*!< Offset: 0x0128   AES Key Word 6 Register                            */
	UINT32 AES_KEY_7;				/*!< Offset: 0x012C   AES Key Word 7 Register                            */
	UINT32 AES_IV0;					/*!< Offset: 0x0130   AES Initial Vector Word 0 Register                 */
	UINT32 AES_IV1;					/*!< Offset: 0x0134   AES Initial Vector Word 1 Register                 */
	UINT32 AES_IV2;					/*!< Offset: 0x0138   AES Initial Vector Word 2 Register                 */
	UINT32 AES_IV3;					/*!< Offset: 0x013C   AES Initial Vector Word 3 Register                 */
	UINT32 AES_SADR;				/*!< Offset: 0x0140   AES Source Address Register                        */
	UINT32 AES_DADR;				/*!< Offset: 0x0144   AES Destination Address Register                   */
	UINT32 AES_CNT;					/*!< Offset: 0x0148   AES Byte Count Register                            */
	UINT32 AES1_KEY_0;				/*!< Offset: 0x014C   AES1 Key Word 0 Register                           */
	UINT32 AES1_KEY_1;				/*!< Offset: 0x0150   AES1 Key Word 1 Register                           */
	UINT32 AES1_KEY_2;				/*!< Offset: 0x0154   AES1 Key Word 2 Register                           */
	UINT32 AES1_KEY_3;				/*!< Offset: 0x0158   AES1 Key Word 3 Register                           */
	UINT32 AES1_KEY_4;				/*!< Offset: 0x015C   AES1 Key Word 4 Register                           */
	UINT32 AES1_KEY_5;				/*!< Offset: 0x0160   AES1 Key Word 5 Register                           */
	UINT32 AES1_KEY_6;				/*!< Offset: 0x0164   AES1 Key Word 6 Register                           */
	UINT32 AES1_KEY_7;				/*!< Offset: 0x0168   AES1 Key Word 7 Register                           */
	UINT32 AES1_IV0;				/*!< Offset: 0x016C   AES1 Initial Vector Word 0 Register                */
	UINT32 AES1_IV1;				/*!< Offset: 0x0170   AES1 Initial Vector Word 1 Register                */
	UINT32 AES1_IV2;				/*!< Offset: 0x0174   AES1 Initial Vector Word 2 Register                */
	UINT32 AES1_IV3;				/*!< Offset: 0x0178   AES1 Initial Vector Word 3 Register                */
	UINT32 AES1_SADR;				/*!< Offset: 0x017C   AES1 Source Address Register                       */
	UINT32 AES1_DADR;				/*!< Offset: 0x0180   AES1 Destination Address Register                  */
	UINT32 AES1_CNT;				/*!< Offset: 0x0184   AES1 Byte Count Register                           */
	UINT32 AES2_KEY_0;				/*!< Offset: 0x0188   AES2 Key Word 0 Register                           */
	UINT32 AES2_KEY_1;				/*!< Offset: 0x018C   AES2 Key Word 1 Register                           */
	UINT32 AES2_KEY_2;				/*!< Offset: 0x0190   AES2 Key Word 2 Register                           */
	UINT32 AES2_KEY_3;				/*!< Offset: 0x0194   AES2 Key Word 3 Register                           */
	UINT32 AES2_KEY_4;				/*!< Offset: 0x0198   AES2 Key Word 4 Register                           */
	UINT32 AES2_KEY_5;				/*!< Offset: 0x019C   AES2 Key Word 5 Register                           */
	UINT32 AES2_KEY_6;				/*!< Offset: 0x01A0   AES2 Key Word 6 Register                           */
	UINT32 AES2_KEY_7;				/*!< Offset: 0x01A4   AES2 Key Word 7 Register                           */
	UINT32 AES2_IV0;				/*!< Offset: 0x01A8   AES2 Initial Vector Word 0 Register                */
	UINT32 AES2_IV1;				/*!< Offset: 0x01AC   AES2 Initial Vector Word 1 Register                */
	UINT32 AES2_IV2;				/*!< Offset: 0x01B0   AES2 Initial Vector Word 2 Register                */
	UINT32 AES2_IV3;				/*!< Offset: 0x01B4   AES2 Initial Vector Word 3 Register                */
	UINT32 AES2_SADR;				/*!< Offset: 0x01B8   AES2 Source Address Register                       */
	UINT32 AES2_DADR;				/*!< Offset: 0x01BC   AES2 Destination Address Register                  */
	UINT32 AES2_CNT;				/*!< Offset: 0x01C0   AES2 Byte Count Register                           */
	UINT32 AES3_KEY_0;				/*!< Offset: 0x01C4   AES3 Key Word 0 Register                           */
	UINT32 AES3_KEY_1;				/*!< Offset: 0x01C8   AES3 Key Word 1 Register                           */
	UINT32 AES3_KEY_2;				/*!< Offset: 0x01CC   AES3 Key Word 2 Register                           */
	UINT32 AES3_KEY_3;				/*!< Offset: 0x01D0   AES3 Key Word 3 Register                           */
	UINT32 AES3_KEY_4;				/*!< Offset: 0x01D4   AES3 Key Word 4 Register                           */
	UINT32 AES3_KEY_5;				/*!< Offset: 0x01D8   AES3 Key Word 5 Register                           */
	UINT32 AES3_KEY_6;				/*!< Offset: 0x01DC   AES3 Key Word 6 Register                           */
	UINT32 AES3_KEY_7;				/*!< Offset: 0x01E0   AES3 Key Word 7 Register                           */
	UINT32 AES3_IV0;				/*!< Offset: 0x01E4   AES3 Initial Vector Word 0 Register                */
	UINT32 AES3_IV1;				/*!< Offset: 0x01E8   AES3 Initial Vector Word 1 Register                */
	UINT32 AES3_IV2;				/*!< Offset: 0x01EC   AES3 Initial Vector Word 2 Register                */
	UINT32 AES3_IV3;				/*!< Offset: 0x01F0   AES3 Initial Vector Word 3 Register                */
	UINT32 AES3_SADR;				/*!< Offset: 0x01F4   AES3 Source Address Register                       */
	UINT32 AES3_DADR;				/*!< Offset: 0x01F8   AES3 Destination Address Register                  */
	UINT32 AES3_CNT;				/*!< Offset: 0x01FC   AES3 Byte Count Register                           */
	UINT32 TDES_CTL;				/*!< Offset: 0x0200   3DES engine parameter  setting                     */
	UINT32 TDES_FLAG;				/*!< Offset: 0x0204   3DES flag setting                                  */
	UINT32 TDES_KEY1H;				/*!< Offset: 0x0208   DES/3DES Key 1 Higher Word Register                */
	UINT32 TDES_KEY1L;				/*!< Offset: 0x020C   DES/3DES Key 1 Lower Word Register                 */
	UINT32 TDES_KEY2H;				/*!< Offset: 0x0210   3DES Key 2 Higher Word Register                    */
	UINT32 TDES_KEY2L;				/*!< Offset: 0x0214   3DES Key 2 Lower Word Register                     */
	UINT32 TDES_KEY3H;				/*!< Offset: 0x0218   3DES Key 3 Higher Word Register                    */
	UINT32 TDES_KEY3L;				/*!< Offset: 0x021C   3DES Key 3 Lower Word Register                     */
	UINT32 TDES_IVH;				/*!< Offset: 0x0220   3DES Initial Vector Higher Word Register           */
	UINT32 TDES_IVL;				/*!< Offset: 0x0224   3DES Initial Vector Lower Word Register            */
	UINT32 TDES_SADR;				/*!< Offset: 0x0228   DES/3DES Source Address Register                   */
	UINT32 TDES_DADR;				/*!< Offset: 0x022C   DES/3DES Destination Address Register              */
	UINT32 TDES_CNT;				/*!< Offset: 0x0230   DES/3DES Block Count Register                      */
	UINT32 TDES_DATAIN;				/*!< Offset: 0x0234   DES/3DES engine Input Word data Register           */
	UINT32 TDES_DATAOUT;				/*!< Offset: 0x0238   DES/3DES engine Output Word data Register          */
	UINT32 RESERVED3[3];				/*!< Offset: 0x023C ~ 0x0244   Reserved                                  */
	UINT32 TDES1_KEY1H;				/*!< Offset: 0x0248   DES/3DES Key 1 Higher Word Register                */
	UINT32 TDES1_KEY1L;				/*!< Offset: 0x024C   DES/3DES Key 1 Lower Word Register                 */
	UINT32 TDES1_KEY2H;				/*!< Offset: 0x0250   3DES Key 2 Higher Word Register                    */
	UINT32 TDES1_KEY2L;				/*!< Offset: 0x0254   3DES Key 2 Lower Word Register                     */
	UINT32 TDES1_KEY3H;				/*!< Offset: 0x0258   3DES Key 3 Higher Word Register                    */
	UINT32 TDES1_KEY3L;				/*!< Offset: 0x025C   3DES Key 3 Lower Word Register                     */
	UINT32 TDES1_IVH;				/*!< Offset: 0x0260   3DES Initial Vector Higher Word Register           */
	UINT32 TDES1_IVL;				/*!< Offset: 0x0264   3DES Initial Vector Lower Word Register            */
	UINT32 TDES1_SADR;				/*!< Offset: 0x0268   DES/3DES Source Address Register                   */
	UINT32 TDES1_DADR;				/*!< Offset: 0x026C   DES/3DES Destination Address Register              */
	UINT32 TDES1_CNT;				/*!< Offset: 0x0270   DES/3DES Block Count Register                      */
	UINT32 RESERVED4[5];				/*!< Offset: 0x0274 ~ 0x0284   Reserved                                  */
	UINT32 TDES2_KEY1H;				/*!< Offset: 0x0288   DES/3DES Key 1 Higher Word Register                */
	UINT32 TDES2_KEY1L;				/*!< Offset: 0x028C   DES/3DES Key 1 Lower Word Register                 */
	UINT32 TDES2_KEY2H;				/*!< Offset: 0x0290   3DES Key 2 Higher Word Register                    */
	UINT32 TDES2_KEY2L;				/*!< Offset: 0x0294   3DES Key 2 Lower Word Register                     */
	UINT32 TDES2_KEY3H;				/*!< Offset: 0x0298   3DES Key 3 Higher Word Register                    */
	UINT32 TDES2_KEY3L;				/*!< Offset: 0x029C   3DES Key 3 Lower Word Register                     */
	UINT32 TDES2_IVH;				/*!< Offset: 0x02A0   3DES Initial Vector Higher Word Register           */
	UINT32 TDES2_IVL;				/*!< Offset: 0x02A4   3DES Initial Vector Lower Word Register            */
	UINT32 TDES2_SADR;				/*!< Offset: 0x02A8   DES/3DES Source Address Register                   */
	UINT32 TDES2_DADR;				/*!< Offset: 0x02AC   DES/3DES Destination Address Register              */
	UINT32 TDES2_CNT;				/*!< Offset: 0x02B0   DES/3DES Block Count Register                      */
	UINT32 RESERVED5[5];				/*!< Offset: 0x02B4 ~ 0x02C4   Reserved                                  */
	UINT32 TDES3_KEY1H;				/*!< Offset: 0x02C8   DES/3DES Key 1 Higher Word Register                */
	UINT32 TDES3_KEY1L;				/*!< Offset: 0x02CC   DES/3DES Key 1 Lower Word Register                 */
	UINT32 TDES3_KEY2H;				/*!< Offset: 0x02D0   3DES Key 2 Higher Word Register                    */
	UINT32 TDES3_KEY2L;				/*!< Offset: 0x02D4   3DES Key 2 Lower Word Register                     */
	UINT32 TDES3_KEY3H;				/*!< Offset: 0x02D8   3DES Key 3 Higher Word Register                    */
	UINT32 TDES3_KEY3L;				/*!< Offset: 0x02DC   3DES Key 3 Lower Word Register                     */
	UINT32 TDES3_IVH;				/*!< Offset: 0x02E0   3DES Initial Vector Higher Word Register           */
	UINT32 TDES3_IVL;				/*!< Offset: 0x02E4   3DES Initial Vector Lower Word Register            */
	UINT32 TDES3_SADR;				/*!< Offset: 0x02E8   DES/3DES Source Address Register                   */
	UINT32 TDES3_DADR;				/*!< Offset: 0x02EC   DES/3DES Destination Address Register              */
	UINT32 TDES3_CNT;				/*!< Offset: 0x02F0   DES/3DES Block Count Register                      */
	UINT32 RESERVED6[3];				/*!< Offset: 0x02F4 ~ 0x02FC   Reserved                                  */
	UINT32 HMAC_CTL;				/*!< Offset: 0x0300   HMAC/SHA engine parameter setting                  */
	volatile UINT32 HMAC_FLAG;			/*!< Offset: 0x0304   HMAC/SHA status flag                               */
	volatile UINT32 HMAC_H0;			/*!< Offset: 0x0308   HMAC/SHA digest message 0                          */
	UINT32 HMAC_H1;					/*!< Offset: 0x030C   HMAC/SHA digest message 1                          */
	UINT32 HMAC_H2;					/*!< Offset: 0x0310   HMAC/SHA digest message 2                          */
	UINT32 HMAC_H3;					/*!< Offset: 0x0314   HMAC/SHA digest message 3                          */
	UINT32 HMAC_H4;					/*!< Offset: 0x0318   HMAC/SHA digest message 4                          */
	UINT32 HMAC_H5;					/*!< Offset: 0x031C   HMAC/SHA digest message 5                          */
	UINT32 HMAC_H6;					/*!< Offset: 0x0320   HMAC/SHA digest message 6                          */
	UINT32 HMAC_H7;					/*!< Offset: 0x0324   HMAC/SHA digest message 7                          */
	UINT32 HMAC_H8;					/*!< Offset: 0x0328   HMAC/SHA digest message 8                          */
	UINT32 HMAC_H9;					/*!< Offset: 0x032C   HMAC/SHA digest message 9                          */
	UINT32 HMAC_H10;				/*!< Offset: 0x0330   HMAC/SHA digest message 10                         */
	UINT32 HMAC_H11;				/*!< Offset: 0x0334   HMAC/SHA digest message 11                         */
	UINT32 HMAC_H12;				/*!< Offset: 0x0338   HMAC/SHA digest message 12                         */
	UINT32 HMAC_H13;				/*!< Offset: 0x033C   HMAC/SHA digest message 13                         */
	UINT32 HMAC_H14;				/*!< Offset: 0x0340   HMAC/SHA digest message 14                         */
	UINT32 HMAC_H15;				/*!< Offset: 0x0344   HMAC/SHA digest message 15                         */
	UINT32 HMAC_KEY_CNT;				/*!< Offset: 0x0348   HMAC/SHA key byte length                           */
	UINT32 HMAC_SADR;				/*!< Offset: 0x034C   HMAC DMA Source Address Register                   */
	UINT32 HMAC_DMA_CNT;				/*!< Offset: 0x0350   HMAC DMA count                                     */
	UINT32 HMAC_DATAIN;				/*!< Offset: 0x0354   HMAC software write to engine port                 */
} 	SECURE_TypeDef;


typedef struct
{
	UINT32 key0;
	UINT32 key1;
	UINT32 key2;
	UINT32 key3;
	UINT32 key4;
	UINT32 key5;
	UINT32 key6;
	UINT32 key7;
	UINT32 iv0;
	UINT32 iv1;
	UINT32 iv2;
	UINT32 iv3;
	UINT32 src_addr;
	UINT32 dst_addr;
	UINT32 count;
}	AES_TypeDef;


typedef struct
{
	UINT32 key1H;
	UINT32 key1L;
	UINT32 key2H;
	UINT32 key2L;
	UINT32 key3H;
	UINT32 key3L;
	UINT32 ivH;
	UINT32 ivL;
	UINT32 src_addr;
	UINT32 dst_addr;
	UINT32 count;
}	TDES_TypeDef;


