OpenNuvoton/NUC970_U-Boot_v2016.11/include/nuc970_crypto.h
#define SECURE           	 	((SECURE_TypeDef *) CRPT_BA)
#define AES0				((AES_TypeDef *)(CRPT_BA+0x110))
#define AES1				((AES_TypeDef *)(CRPT_BA+0x14C))
#define AES2				((AES_TypeDef *)(CRPT_BA+0x188))
#define AES3				((AES_TypeDef *)(CRPT_BA+0x1C4))
#define TDES0				((AES_TypeDef *)(CRPT_BA+0x208))
#define TDES1				((AES_TypeDef *)(CRPT_BA+0x248))
#define TDES2				((AES_TypeDef *)(CRPT_BA+0x288))
#define TDES3				((AES_TypeDef *)(CRPT_BA+0x2C8))


/********************* Bit definition of IPSEC_INT_EN  ************************/
#define SECURE_INT_EN_AES		((UINT32)0x00000001)			/*!<AES DMA finish interrupt flag enable */
#define SECURE_INT_EN_AES_ERR		((UINT32)0x00000002)			/*!<AES error flag enable */
#define SECURE_INT_EN_TDES		((UINT32)0x00000100)			/*!<TDES interrupt source enable */
#define SECURE_INT_EN_TDES_ERR		((UINT32)0x00000200)			/*!<TDES error flag enable */
#define SECURE_INT_EN_PRNG		((UINT32)0x00010000)			/*!<PRNG finish interrupt enable */
#define SECURE_INT_EN_HMAC		((UINT32)0x01000000)			/*!<HMAC interrupt enable */
#define SECURE_INT_EN_HMAC_ERR		((UINT32)0x02000000)			/*!<HMAC error interrupt enable */

/********************* Bit definition of IPSEC_INT_FLAG *******************/
#define SECURE_INT_FLAG_AES_DONE	((UINT32)0x00000001)			/*!<AES finish interrupt flag */
#define SECURE_INT_FLAG_AES_ERR		((UINT32)0x00000002)			/*!<AES error flag */
#define SECURE_INT_FLAG_TDES_DONE	((UINT32)0x00000100)			/*!<TDES finish interrupt flag */
#define SECURE_INT_FLAG_TDES_ERR	((UINT32)0x00000200)			/*!<TDES error flag */
#define SECURE_INT_FLAG_PRNG_DONE	((UINT32)0x00010000)			/*!<PRNG finish interrupt flag */
#define SECURE_INT_FLAG_HMAC_DONE	((UINT32)0x01000000)			/*!<HMAC finish interrupt flag */
#define SECURE_INT_FLAG_HMAC_ERR	((UINT32)0x02000000)			/*!<HMAC error flag */

/********************* Bit definition of PRNG_CTL *******************/
#define SECURE_PRNG_CTL_START		((UINT32)0x00000001)			/*!<Write ¡§1¡¨ start PRNG engine generate new KEY and store KEYx register. */
#define SECURE_PRNG_CTL_SEED_RELOAD	((UINT32)0x00000002)			/*!1: reload new seed; 0: generate key base original seed. */
#define SECURE_PRNG_CTL_KEY_SIZE_MASK	((UINT32)0x0000000C)			/*!<PRNG KEY SIZE bit mask */
#define SECURE_PRNG_CTL_KEY_SIZE_64	((UINT32)0x00000000)			/*!<PRNG 64 bits key */
#define SECURE_PRNG_CTL_KEY_SIZE_128	((UINT32)0x00000004)			/*!<PRNG 128 bits key */
#define SECURE_PRNG_CTL_KEY_SIZE_192	((UINT32)0x00000008)			/*!<PRNG 192 bits key */
#define SECURE_PRNG_CTL_KEY_SIZE_256	((UINT32)0x0000000C)			/*!<PRNG 256 bits key */
#define SECURE_PRNG_CTL_BUSY		((UINT32)0x00000100)			/*!<read only, 1:  indicate the PRNG engine under generating KEY */


/********************* Bit definition of AES_CTL *******************/
#define SECURE_AES_CTL_START		((UINT32)0x00000001)			/*!<Write ¡§1¡¨, AES engine starting. AES_BUSY flag will be set. */
#define SECURE_AES_CTL_STOP		((UINT32)0x00000002)			/*!<Write ¡§1¡¨ ,  stop  AES engine instantly. */
#define SECURE_AES_CTL_KEY_SIZE_MASK	((UINT32)0x0000000C)			/*!<AES KEY_SIZE bit mask */
#define SECURE_AES_CTL_KEY_SIZE_128	((UINT32)0x00000000)			/*!<AES 128 bits key */
#define SECURE_AES_CTL_KEY_SIZE_192	((UINT32)0x00000004)			/*!<AES 192 bits key */
#define SECURE_AES_CTL_KEY_SIZE_256	((UINT32)0x00000008)			/*!<AES 256 bits key */
#define SECURE_AES_CTL_EXT_KEY		((UINT32)0x00000010)			/*!<1: AES KEY use extend key. 0:  AES KEY source form  AES_KEYx registers. */
#define SECURE_AES_CTL_LAST		((UINT32)0x00000020)			/*!<Index current operation is  last one. */
#define SECURE_AES_CTL_DMA_CASCADE	((UINT32)0x00000040)			/*!<Cascade AES encrypt/decrypt result */
#define SECURE_AES_CTL_DMA_EN		((UINT32)0x00000080)			/*!<enable AES DMA engine */
#define SECURE_AES_CTL_OP_MASK 		((UINT32)0x0000FF00)			/*!<AES engine operation mode bit mask */
#define SECURE_AES_CTL_OP_ECB		((UINT32)0x00000000)			/*!<AES ECB mode */
#define SECURE_AES_CTL_OP_CBC		((UINT32)0x00000100)			/*!<AES CBC mode */
#define SECURE_AES_CTL_OP_CFB		((UINT32)0x00000200)			/*!<AES CFB mode */
#define SECURE_AES_CTL_OP_OFB		((UINT32)0x00000300)			/*!<AES OFB mode */
#define SECURE_AES_CTL_OP_CTR		((UINT32)0x00000400)			/*!<AES CTR mode */
#define SECURE_AES_CTL_OP_CBS_CS1	((UINT32)0x00001000)			/*!<AES CBS CS1 mode */
#define SECURE_AES_CTL_OP_CBS_CS2	((UINT32)0x00001100)			/*!<AES CBS CS2 mode */
#define SECURE_AES_CTL_OP_CBS_CS3	((UINT32)0x00001200)			/*!<AES CBS CS3 mode */
#define SECURE_AES_CTL_OP_CMAC		((UINT32)0x00002000)			/*!<AES CMAC mode */
#define SECURE_AES_CTL_OP_CCM		((UINT32)0x00003000)			/*!<AES CCM mode */
#define SECURE_AES_CTL_OP_GCM		((UINT32)0x00004000)			/*!<AES GCM mode */
#define SECURE_AES_CTL_OP_XTS		((UINT32)0x00005000)			/*!<AES XTS mode */
#define SECURE_AES_CTL_OP_XCBC3		((UINT32)0x00006000)			/*!<AES XCBC3 mode */
#define SECURE_AES_CTL_OP_XCBC1		((UINT32)0x00006100)			/*!<AES XCBC1 mode */
#define SECURE_AES_CTL_ENCRYPT		((UINT32)0x00010000)			/*!<AES engine execute encryption */
#define SECURE_AES_CTL_DECRYPT		((UINT32)0x00000000)			/*!<AES engine execute decryption */
#define SECURE_AES_CTL_OUT_TRANS	((UINT32)0x00400000)			/*!<AES engine output data transform */
#define SECURE_AES_CTL_IN_TRANS		((UINT32)0x00800000)			/*!<AES engine input data transform */
#define SECURE_AES_CTL_CHANNEL_MASK	((UINT32)0x03000000)			/*!<AES working channel bit mask */
#define SECURE_AES_CTL_CHANNEL_0	((UINT32)0x00000000)			/*!<AES Current  control register  setting on channel 0 */
#define SECURE_AES_CTL_CHANNEL_1	((UINT32)0x01000000)			/*!<AES Current  control register  setting on channel 0 */
#define SECURE_AES_CTL_CHANNEL_2	((UINT32)0x02000000)			/*!<AES Current  control register  setting on channel 0 */
#define SECURE_AES_CTL_CHANNEL_3	((UINT32)0x03000000)			/*!<AES Current  control register  setting on channel 0 */
#define SECURE_AES_CTL_KEY_UNPROTECT_MASK	((UINT32)0xFC000000)		/*!<AES unprotect key bit mask */
#define SECURE_AES_CTL_KEY_UNPROTECT	((UINT32)0x58000000)			/*!<Set AES unprotect key */
#define SECURE_AES_CTL_KEY_PROTECT	((UINT32)0x80000000)			/*!<AES key protect */

/********************* Bit definition of AES_FLAG *******************/
#define SECURE_AES_FLAG_BUSY		((UINT32)0x00000001)			/*!<AES engine under archiving */
#define SECURE_AES_FLAG_IN_BUF_EMPTY	((UINT32)0x00000100)			/*!<AES input buffer empty */
#define SECURE_AES_FLAG_IN_BUF_FULL	((UINT32)0x00000200)			/*!<AES input buffer full */
#define SECURE_AES_FLAG_IN_BUF_ERR	((UINT32)0x00000400)			/*!<ERROR during feed AES engine data. */
#define SECURE_AES_FLAG_CNT_ERR		((UINT32)0x00001000)			/*!<AES_CNT setting error */
#define SECURE_AES_FLAG_OUT_BUF_EMPTY	((UINT32)0x00010000)			/*!<AES output buffer empty */
#define SECURE_AES_FLAG_OUT_BUF_FULL	((UINT32)0x00020000)			/*!<AES output buffer full */
#define SECURE_AES_FLAG_OUT_BUF_ERR	((UINT32)0x00040000)			/*!<ERROR during get AES engine result */
#define SECURE_AES_FLAG_BUS_ERR		((UINT32)0x00100000)			/*!<AES bus error */

/********************* Bit definition of TDES_CTL *******************/
#define SECURE_TDES_CTL_START		((UINT32)0x00000001)			/*!<Write ¡§1¡¨, TDES engine starting. AES_BUSY flag will be set. */
#define SECURE_TDES_CTL_STOP		((UINT32)0x00000002)			/*!<Write ¡§1¡¨ , stop TDES engine instantly. */
#define SECURE_TDES_CTL_3_MODE 		((UINT32)0x00000004)			/*!<Tripple DES mode */
#define SECURE_TDES_CTL_3KEYS 		((UINT32)0x00000008)			/*!<enable triple KEY in TDES engine */
#define SECURE_TDES_CTL_EXT_KEY		((UINT32)0x00000010)			/*!<TDES KEY use extend key */
#define SECURE_TDES_CTL_LAST_START	((UINT32)0x00000020)			/*!<TDES last DMA cascade round */
#define SECURE_TDES_CTL_CASCADE		((UINT32)0x00000040)			/*!<TDES DMA cascade mode */
#define SECURE_TDES_CTL_DMA_EN		((UINT32)0x00000080)			/*!<enable TDES_DMA engine */
#define SECURE_TDES_CTL_OP_MASK		((UINT32)0x00000700)			/*!<TDES engine operation mode bit mask */
#define SECURE_TDES_CTL_OP_ECB		((UINT32)0x00000000)			/*!<ECB mode */
#define SECURE_TDES_CTL_OP_CBC		((UINT32)0x00000100)			/*!<CBC mode */
#define SECURE_TDES_CTL_OP_CFB		((UINT32)0x00000200)			/*!<CFB mode */
#define SECURE_TDES_CTL_OP_OFB		((UINT32)0x00000300)			/*!<OFB mode */
#define SECURE_TDES_CTL_OP_CTR		((UINT32)0x00000400)			/*!<CTR mode */
#define SECURE_TDES_CTL_ENCRYPT		((UINT32)0x00010000)			/*!<TDES engine execute encryption */
#define SECURE_TDES_CTL_DECRYPT		((UINT32)0x00000000)			/*!<TDES engine execute decryption */
#define SECURE_TDES_CTL_BLOCK_FORMAT	((UINT32)0x00200000)			/*!<TDES engine Swap High/Low word */
#define SECURE_TDES_CTL_OUT_TRANS	((UINT32)0x00400000)			/*!<TDES engine output data transform */
#define SECURE_TDES_CTL_IN_TRANS	((UINT32)0x00800000)			/*!<TDES engine input data transform */
#define SECURE_TDES_CTL_CHANNEL_MASK	((UINT32)0x03000000)			/*!<TDES working channel bit mask */
#define SECURE_TDES_CTL_CHANNEL_0	((UINT32)0x00000000)			/*!<TDES Current  control register  setting on channel 0 */
#define SECURE_TDES_CTL_CHANNEL_1	((UINT32)0x01000000)			/*!<TDES Current  control register  setting on channel 0 */
#define SECURE_TDES_CTL_CHANNEL_2	((UINT32)0x02000000)			/*!<TDES Current  control register  setting on channel 0 */
#define SECURE_TDES_CTL_CHANNEL_3	((UINT32)0x03000000)			/*!<TDES Current  control register  setting on channel 0 */
#define SECURE_TDES_CTL_KEY_UNPROTECT_MASK ((UINT32)0xFC000000)			/*!<TDES unprotect key bit mask */
#define SECURE_TDES_CTL_KEY_UNPROTECT  	((UINT32)0x58000000)			/*!<Set TDES unprotect key */
#define SECURE_TDES_CTL_KEY_PROTECT	((UINT32)0x80000000)			/*!<TDES key protect */

/********************* Bit definition of TDES_FLAG *******************/
#define SECURE_TDES_FLAG_BUSY		((UINT32)0x00000001)			/*!<TDES engine under archiving */
#define SECURE_TDES_FLAG_IN_BUF_EMPTY	((UINT32)0x00000100)			/*!<TDES input buffer empty */
#define SECURE_TDES_FLAG_IN_BUF_FULL	((UINT32)0x00000200)			/*!<TDES input buffer full */
#define SECURE_TDES_FLAG_IN_BUF_ERR	((UINT32)0x00000400)			/*!<ERROR during feed TDES engine data. */
#define SECURE_TDES_FLAG_OUT_BUF_EMPTY	((UINT32)0x00010000)			/*!<TDES output buffer empty */
#define SECURE_TDES_FLAG_OUT_BUF_FULL	((UINT32)0x00020000)			/*!<TDES output buffer full */
#define SECURE_TDES_FLAG_OUT_BUF_ERR	((UINT32)0x00040000)			/*!<ERROR during get TDES engine result */
#define SECURE_TDES_FLAG_BUS_ERR	((UINT32)0x00100000)			/*!<TDES bus error */

/********************* Bit definition of HMAC_CTL ********************/
#define SECURE_HMAC_START		((UINT32)0x00000001)			/*!<HMAC engine starting */
#define SECURE_HMAC_STOP		((UINT32)0x00000002)			/*!<HMAC engine stop */
#define SECURE_HMAC_EN			((UINT32)0x00000010)			/*!<execute HMAC function */
#define SECURE_HMAC_LAST		((UINT32)0x00000020)			/*!<last DMA cascade round */
#define SECURE_HMAC_DMA_EN		((UINT32)0x00000080)			/*!<enable HMAC_DMA engine */
#define SECURE_HMAC_OP_MASK		((UINT32)0x00000700)			/*!<HMAC engine operation modes mask */
#define SECURE_HMAC_OP_SHA1		((UINT32)0x00000000)			/*!<SHA1 */
#define SECURE_HMAC_OP_SHA224		((UINT32)0x00000500)			/*!<SHA224 */
#define SECURE_HMAC_OP_SHA256		((UINT32)0x00000400)			/*!<SHA256 */
#define SECURE_HMAC_OP_SHA384		((UINT32)0x00000700)			/*!<SHA384 */
#define SECURE_HMAC_OP_SHA512		((UINT32)0x00000600)			/*!<SHA512 */
#define SECURE_HMAC_OUT_TRANSFORM	((UINT32)0x00400000)			/*!<HMAC engine output data transform */
#define SECURE_HMAC_IN_TRANSFORM	((UINT32)0x00800000)			/*!<HMAC engine input data transform */

/********************* Bit definition of HMAC_FLAG *******************/
#define SECURE_HMAC_BUSY		((UINT32)0x00000001)			/*!<HMAC engine busy */
#define SECURE_HMAC_DMA_BUSY		((UINT32)0x00000002)			/*!<HMAC engine is under active */
#define SECURE_HMAC_DMA_ERR		((UINT32)0x00000100)			/*!<HMAC DMA error */
#define SECURE_HMAC_DIN_REQ		((UINT32)0x00010000)			/*!<HMAC_SOFTWARE mode Data input  request */

typedef struct
{
	UINT32 KEYEN;					/*!< Offset: 0x0000   Key Enable Register		*/
	UINT32 RESERVED1[2];				/*!< Offset: 0x0004 ~ 0x0008 Reserved			*/
	UINT32 USERDATA;				/*!< Offset: 0x000C   User Defined Data Register	*/
	UINT32 KEY_0;					/*!< Offset: 0x0010   Key Word 0 Register		*/
	UINT32 KEY_1;					/*!< Offset: 0x0014   Key Word 1 Register		*/
	UINT32 KEY_2;					/*!< Offset: 0x0018   Key Word 2 Register		*/
	UINT32 KEY_3;					/*!< Offset: 0x001C   Key Word 3 Register		*/
	UINT32 KEY_4;					/*!< Offset: 0x0020   Key Word 4 Register		*/
	UINT32 KEY_5;					/*!< Offset: 0x0024   Key Word 5 Register		*/
	UINT32 KEY_6;					/*!< Offset: 0x0028   Key Word 6 Register		*/
	UINT32 KEY_7;					/*!< Offset: 0x002C   Key Word 7 Register		*/
	UINT32 PCYCLE;					/*!< Offset: 0x0030   Program Cycle Control Register	*/
	UINT32 CTL;					/*!< Offset: 0x0034   Control Register			*/
	UINT32 PSTART;					/*!< Offset: 0x0038   Program Start Register		*/
	UINT32 RESERVED2;				/*!< Offset: 0x003C   Reserved				*/
	UINT32 STATUS;					/*!< Offset: 0x0040   Status Register			*/
	UINT32 RESERVED3[3];				/*!< Offset: 0x0044 ~ 0x004C Reserved			*/
	UINT32 REGLCTL;					/*!< Offset: 0x0050   Write-Protection Control Register */
} MTP_TypeDef;

#define MTP				((MTP_TypeDef *) OTP_BA)

#define MTP_KEYEN_KEYEN			((UINT32)0x00000001)
#define MTP_CTL_OP_MASK			((UINT32)0x00000003)
#define MTP_CTL_OP_IDLE			((UINT32)0x00000000)
#define MTP_CTL_OP_PROG			((UINT32)0x00000002)
#define MTP_CTL_OP_LOCK			((UINT32)0x00000003)

#define MTP_PSTART_PSTART		((UINT32)0x00000001)

#define MTP_STATUS_MTPEN		((UINT32)0x00000001)
#define MTP_STATUS_KEYVALID		((UINT32)0x00000002)
#define MTP_STATUS_NONPRG		((UINT32)0x00000004)
#define MTP_STATUS_LOCKED		((UINT32)0x00000008)
#define MTP_STATUS_PRGFAIL		((UINT32)0x00000010)
#define MTP_STATUS_CNT_MACK		((UINT32)0x000F0000)
#define MTP_STATUS_BUSY			((UINT32)0x01000000)

#define MTP_REGLCTL_PWD_MASK		((UINT32)0x000000FF)
#define MTP_REGLCTL_PRTDIS		((UINT32)0x00000001)

#endif  /* _CRYPTO_H_ */
